app/controllers/posts_controller.rb

  def show
    @comments = Comment.where(post_id: @post)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 4

  def create
		@post = current_user.posts.build(post_params)

		if @post.save
---
INSERT INTO "posts" ("title", "link", "description", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Another Post Updated"], ["description", "%h1 This is the placeholder e.e\r\n  "], ["updated_at", 2017-04-10 18:20:30 UTC], ["id", 2]]

  def find_post
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE ("posts"."id" != 4) ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]